import numpy as np


dataset = np.array([['帅', '不好', '矮', '不上进', '不嫁'],
                    ['不帅', '好', '矮', '上进', '不嫁'],
                    ['帅', '好', '矮', '上进', '嫁'],
                    ['不帅', '好', '高', '上进', '嫁'],
                    ['帅', '不好', '矮', '上进', '不嫁'],
                    ['不帅', '不好', '矮', '不上进', '不嫁'],
                    ['帅', '好', '高', '不上进', '嫁'],
                    ['不帅', '好', '中', '上进', '嫁'],
                    ['帅', '好', '中', '上进', '嫁'],
                    ['不帅', '不好', '高', '上进', '嫁'],
                    ['帅', '好', '矮', '不上进', '不嫁'],
                    ['帅', '好', '矮', '不上进', '不嫁']])
feature_names = np.array(['外贸', '性格', '身高', '上进心'])
